 insert into [Status] (name)
 values ('Awaiting'), ('Ready'),('Sent'),('Failed')

insert into Reminder (id, date, message, contact_id, status)
values  ('00000000-0000-0000-0000-111111111111', '2022-09-01 20:00:00.000', N'Пора на рыбалку', 'contact_1', 0),
		('00000000-0000-0000-0000-222222222222', '2022-09-02 20:00:00.000', N'Пора заняться программированием', 'contact_2', 0),
		('00000000-0000-0000-0000-333333333333', '2022-09-03 20:00:00.000', N'Надо поспать', 'contact_3', 1),
		('00000000-0000-0000-0000-444444444444', '2022-09-04 20:00:00.000', N'Надо поесть', 'contact_4', 1),
		('00000000-0000-0000-0000-555555555555', '2022-09-05 20:00:00.000', N'Надо погулять', 'contact_5', 2)